rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
// ============================================================
// TELEGRAM IZEJOŠO ZIŅU RINDA
// ============================================================

// Ja MQTT īslaicīgi pazūd tieši sūkņa izslēgšanās brīdī,
// Telegram paziņojumu nezaudējam.
// Saglabājam un nosūtām pēc MQTT atjaunošanās.

constexpr uint8_t TELEGRAM_QUEUE_SIZE = 8;

String telegramQueue[TELEGRAM_QUEUE_SIZE];

uint8_t telegramQueueHead = 0;
uint8_t telegramQueueTail = 0;
uint8_t telegramQueueCount = 0;

// ============================================================
// PALĪGFUNKCIJAS
// ============================================================

String getTimeString() {
  time_t now = time(nullptr);

  // NTP vēl nav sinhronizējies.
  if (now < 1700000000) {
    return "nezināms laiks";
  }

  struct tm timeinfo;
  localtime_r(&now, &timeinfo);

  char buf[32];

  strftime(
    buf,
    sizeof(buf),
    "%d.%m.%Y %H:%M:%S",
    &timeinfo
  );

  return String(buf);
}

String getUptimeString() {
  uint64_t uptimeSeconds =
      static_cast<uint64_t>(esp_timer_get_time()) / 1000000ULL;

  uint64_t days = uptimeSeconds / 86400ULL;
  uint64_t hours = (uptimeSeconds % 86400ULL) / 3600ULL;
  uint64_t minutes = (uptimeSeconds % 3600ULL) / 60ULL;

  char buf[64];

  if (days > 0) {
    snprintf(
      buf,
      sizeof(buf),
      "%llu d %llu h %llu min",
      static_cast<unsigned long long>(days),
      static_cast<unsigned long long>(hours),
      static_cast<unsigned long long>(minutes)
    );
  } else if (hours > 0) {
    snprintf(
      buf,
      sizeof(buf),
      "%llu h %llu min",
      static_cast<unsigned long long>(hours),
      static_cast<unsigned long long>(minutes)
    );
  } else {
    snprintf(
      buf,
      sizeof(buf),
      "%llu min",
      static_cast<unsigned long long>(minutes)
    );
  }

  return String(buf);
}

String resetReasonStr() {
  switch (esp_reset_reason()) {
    case ESP_RST_POWERON:
      return "Strāvas ieslēgšana";

    case ESP_RST_SW:
      return "Programmatūras restarts";

    case ESP_RST_PANIC:
      return "PANIC — kods avarēja";

    case ESP_RST_INT_WDT:
      return "Interrupt watchdog";

    case ESP_RST_TASK_WDT:
      return "TASK WATCHDOG — kods iesprūda";

    case ESP_RST_WDT:
      return "Cits watchdog";

    case ESP_RST_BROWNOUT:
      return "BROWNOUT — sprieguma kritums";

    case ESP_RST_DEEPSLEEP:
      return "Deep sleep";

    case ESP_RST_EXT:
      return "Ārējais reset";

    default:
      return "Nezināms";
  }
}

void sendSyslog(const String& msg) {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  String packet = "<134>balkons-esp32 " + msg;

  udp.beginPacket(
    SYSLOG_SERVER,
    SYSLOG_PORT
  );

  udp.print(packet);
  udp.endPacket();
}

// ============================================================
// WATCHDOG
// ============================================================

void setupWatchdog() {

#if ESP_ARDUINO_VERSION_MAJOR >= 3

  esp_task_wdt_config_t wdtConfig = {
    .timeout_ms = WDT_TIMEOUT_S * 1000UL,
    .idle_core_mask = 0,
    .trigger_panic = true
  };

  // Noskaidrojam pašreizējo TWDT stāvokli.
  esp_err_t status = esp_task_wdt_status(nullptr);

  esp_err_t result;

  if (status == ESP_ERR_INVALID_STATE) {

    // TWDT vēl nav inicializēts.
    result = esp_task_wdt_init(&wdtConfig);

  } else {

    // TWDT jau darbojas.
    result = esp_task_wdt_reconfigure(&wdtConfig);
  }

  if (result != ESP_OK) {
    Serial.printf(
      "WDT konfigurācijas kļūda: %s\n",
      esp_err_to_name(result)
    );

    watchdogSubscribed = false;
    return;
  }

  // Pārbaudām, vai pašreizējais loop task jau ir abonēts.
  status = esp_task_wdt_status(nullptr);

  if (status == ESP_OK) {

    watchdogSubscribed = true;

  } else {

    result = esp_task_wdt_add(nullptr);

    if (result == ESP_OK) {
      watchdogSubscribed = true;
    } else {
      watchdogSubscribed = false;

      Serial.printf(
        "WDT task abonēšanas kļūda: %s\n",
        esp_err_to_name(result)
      );
    }
  }

#else

  esp_err_t result =
      esp_task_wdt_init(WDT_TIMEOUT_S, true);

  // Dažās vecākās ESP-IDF versijās WDT var būt
  // jau inicializēts.
  if (
      result != ESP_OK &&
      result != ESP_ERR_INVALID_STATE
  ) {
    Serial.printf(
      "WDT init kļūda: %s\n",
      esp_err_to_name(result)
    );

    watchdogSubscribed = false;
    return;
  }

  result = esp_task_wdt_add(nullptr);

  if (result == ESP_OK) {
    watchdogSubscribed = true;
  } else {
    Serial.printf(
      "WDT task abonēšanas kļūda: %s\n",
      esp_err_to_name(result)
    );

    watchdogSubscribed = false;
  }

#endif

  if (watchdogSubscribed) {
    Serial.println("Watchdog aktīvs");
  }
}

void feedWatchdog() {
  if (watchdogSubscribed) {
    esp_task_wdt_reset();
  }
}

void disableWatchdogForOTA() {
  if (!watchdogSubscribed) {
    return;
  }

  esp_task_wdt_delete(nullptr);
  watchdogSubscribed = false;
}

// ============================================================
// TELEGRAM ZIŅU RINDA
// ============================================================

void enqueueTelegramMessage(const String& msg) {

  // Ja rinda pilna, izmetam vecāko ziņu,
  // lai jaunākā netiktu pazaudēta.
  if (telegramQueueCount >= TELEGRAM_QUEUE_SIZE) {

    telegramQueue[telegramQueueHead] = "";

    telegramQueueHead =
        (telegramQueueHead + 1) %
        TELEGRAM_QUEUE_SIZE;

    telegramQueueCount--;

    Serial.println(
      "BRĪDINĀJUMS: Telegram rinda pilna, "
      "vecākā ziņa izmesta"
    );
  }

  telegramQueue[telegramQueueTail] = msg;

  telegramQueueTail =
      (telegramQueueTail + 1) %
      TELEGRAM_QUEUE_SIZE;

  telegramQueueCount++;
}

bool telegramPayloadAllowed(const String& msg) {
  return mqtt_runtime_policy::canStoreTrackedPayload(msg.length());
}

void dropOversizedTelegramMessage(const String& msg) {
  oversizedTelegramDrops++;

  Serial.printf(
    "BRĪDINĀJUMS: Telegram ziņa par garu (%u > %u baiti)\n",
    static_cast<unsigned int>(msg.length()),
    static_cast<unsigned int>(
      mqtt_runtime_policy::kTrackedPayloadTextMaxBytes
    )
  );
}

