rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
void tgSend(const String& msg) {

  if (!telegramPayloadAllowed(msg)) {
    dropOversizedTelegramMessage(msg);
    return;
  }

  // Adaptera fixed copy ir lokāls staging solis. Ja session init vēl nav
  // pabeigts, jauns network PUBLISH netiks sūknēts līdz Done stāvoklim.
  if (
      !mqtt.trackedPublishBusy() &&
      mqtt.startTrackedPublish(
        T_OUT,
        msg.c_str()
      )
  ) {
    return;
  }

  enqueueTelegramMessage(msg);
}

void serviceTelegramDelivery() {

  if (!mqttSessionReady()) {
    return;
  }

  if (mqtt.trackedPublishBusy()) {
    mqtt.pumpTrackedPublish();
    return;
  }

  if (telegramQueueCount == 0) {
    return;
  }

  String msg =
      telegramQueue[telegramQueueHead];

  if (!telegramPayloadAllowed(msg)) {
    dropOversizedTelegramMessage(msg);

    telegramQueue[telegramQueueHead] = "";
    telegramQueueHead =
        (telegramQueueHead + 1) %
        TELEGRAM_QUEUE_SIZE;
    telegramQueueCount--;
    return;
  }

  if (
      !mqtt.startTrackedPublish(
        T_OUT,
        msg.c_str()
      )
  ) {
    return;
  }

  // No šī brīža adapterim pieder fixed copy; app queue head drīkst atbrīvot.
  telegramQueue[telegramQueueHead] = "";
  telegramQueueHead =
      (telegramQueueHead + 1) %
      TELEGRAM_QUEUE_SIZE;
  telegramQueueCount--;

  // Vienā izsaukumā maksimums viens jauns network PUBLISH mēģinājums.
  mqtt.pumpTrackedPublish();
}

// ============================================================
// LOGI
// ============================================================

bool mqttDiagnosticPublishAllowed() {
  if (!mqtt.isConnected()) {
    return false;
  }

  return mqttSessionReady() ||
         mqttSessionInitState == MqttSessionInitState::ConnectedLog ||
         mqttSessionInitState == MqttSessionInitState::StartupLog ||
         mqttSessionInitState == MqttSessionInitState::WifiRestoredLog;
}

void logEvent(const String& msg) {

  String line =
      getTimeString() +
      " | " +
      msg;

  Serial.println(
    "LOG: " +
    line
  );

  if (mqttDiagnosticPublishAllowed()) {
    mqtt.publishBestEffort(
      T_LOG,
      line.c_str(),
      false
    );
  }

  sendSyslog(msg);
}

// ============================================================
// SŪKŅA VADĪBA
// ============================================================

bool publishPumpStatus() {

  if (!mqtt.isConnected()) {
    return false;
  }

  if (
      !mqttSessionReady() &&
      mqttSessionInitState != MqttSessionInitState::PumpStatus
  ) {
    return false;
  }

  return mqtt.publishBestEffort(
    T_PUMP_ST,
    pumpRunning ? "ON" : "OFF",
    true
  );
}

bool startPump(uint32_t seconds) {

  // Ja STOP/OFF tikko saņemts, vispirms jāpabeidz tā stāvokļa
  // reconciliācija. Tas nepieļauj pump startu vienā un tajā pašā
  // loop logā pirms urgent stop apstrādes.
  if (urgentPumpStopPending) {
    return false;
  }

  if (pumpRunning) {
    return false;
  }

  seconds =
      pump_timing_policy::normalizeRequestedSeconds(
        seconds,
        DEFAULT_PUMP_SECONDS,
        MAX_PUMP_SECONDS
      );

  uint32_t now = millis();

  digitalWrite(
    RELAY_PIN,
    RELAY_ON
  );

  pumpRunning = true;

  pumpSessionStartMs = now;

  pumpPlannedDurationMs =
      seconds * 1000UL;

  totalWaterings++;

  lastWateringTime =
      time(nullptr);

  rtcPumpWasRunning = true;

  logEvent(
    "Sūknis IESLĒGTS uz " +
    String(seconds) +
    " sek"
  );

  publishPumpStatus();

  tgSend(
    "💧 Laistīšana sākta! (" +
    String(seconds) +
    " sek)"
  );

  return true;
}

uint32_t extendPump(uint32_t additionalSeconds) {

  if (!pumpRunning) {
    return 0;
  }

  const auto extension =
      pump_timing_policy::extendPlannedDuration(
        pumpPlannedDurationMs,
        additionalSeconds,
        MAX_PUMP_SECONDS
      );

  pumpPlannedDurationMs =
      extension.plannedDurationMs;

  const uint32_t actuallyAddedMs =
      extension.addedMs;

  if (actuallyAddedMs > 0) {

    logEvent(
      "Sūkņa laiks PAGARINĀTS par " +
      String(actuallyAddedMs / 1000UL) +
      " sek; kopējais limits: " +
      String(pumpPlannedDurationMs / 1000UL) +
      " sek"
    );
  }

  return actuallyAddedMs / 1000UL;
}

void stopPump(
  const String& reason = "manuāli"
) {

  // Fiziski izslēdzam releju vienmēr,
  // pat ja programmatūra domā, ka sūknis jau OFF.
  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  if (pumpRunning) {

    uint32_t elapsedMs =
        millis() -
        pumpSessionStartMs;

    lastRunSeconds =
        elapsedMs / 1000UL;

    totalPumpSeconds +=
        lastRunSeconds;

    notifyPumpDone = true;
  }

  pumpRunning = false;

  pumpPlannedDurationMs = 0;

  rtcPumpWasRunning = false;

  logEvent(
    "Sūknis IZSLĒGTS — " +
    reason
  );

  publishPumpStatus();
}

void servicePump() {

  if (!pumpRunning) {
    return;
  }

  const uint32_t now =
      millis();

  constexpr uint32_t hardLimitMs =
      MAX_PUMP_SECONDS * 1000UL;

  // Absolūtais drošības limits.
  // To nevar pagarināt ar komandām.
  if (
      pump_timing_policy::hasElapsed(
        now,
        pumpSessionStartMs,
        hardLimitMs
      )
  ) {

    stopPump(
      "sasniegts maksimālais " +
      String(MAX_PUMP_SECONDS) +
      " sek limits"
    );

    return;
  }

  // Parastais ieplānotais izslēgšanas laiks.
  if (
      pumpPlannedDurationMs > 0 &&
      pump_timing_policy::hasElapsed(
        now,
        pumpSessionStartMs,
        pumpPlannedDurationMs
      )
  ) {

    stopPump(
      "plānotais laiks beidzies"
    );
  }
}

// ============================================================
// URGENT SŪKŅA STOP/OFF
// ============================================================

void requestUrgentPumpStop(bool fromHA) {

  // Drošības efekts notiek uzreiz callback kontekstā: tikai GPIO OFF.
  // MQTT publish/logging šeit apzināti neveicam, lai neizraisītu
  // PubSubClient re-entrancy.
  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  pumpStopEpoch++;
  urgentPumpStopPending = true;
  urgentPumpStopFromHA = fromHA;
}

void serviceUrgentPumpStop() {

