rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
  if (!urgentPumpStopPending) {
    return;
  }

  bool fromHA = urgentPumpStopFromHA;

  urgentPumpStopPending = false;
  urgentPumpStopFromHA = false;

  if (pumpRunning) {

    stopPump(
      fromHA ?
      "Home Assistant OFF (urgent)" :
      "manuāla STOP komanda (urgent)"
    );

    return;
  }

  // Pat ja programmatūras stāvoklis jau bija OFF, uzturam fizisko
  // fail-safe stāvokli un atjaunojam retained MQTT statusu.
  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  publishPumpStatus();

  if (!fromHA) {
    tgSend(
      "Sūknis jau bija izslēgts."
    );
  }
}

// Garāku sensoru lasījumu laikā pieņemam MQTT inputu, bet
// neuzsākam reconnect. Tas ļauj saņemt STOP/OFF starp sensoriem
// un tūlīt pēc mqtt.loop() atgriešanās pabeigt stop reconciliāciju.
void servicePumpCriticalNetworkInput() {

  if (!mqtt.isDisconnected()) {
    mqtt.service();
  }

  serviceUrgentPumpStop();
  servicePump();
  feedWatchdog();
}

// ============================================================
// OTA
// ============================================================

void setupOTA() {

  if (otaStarted) {
    return;
  }

  if (
      WiFi.status() !=
      WL_CONNECTED
  ) {
    return;
  }

  ArduinoOTA.setHostname(
    OTA_HOSTNAME
  );

  ArduinoOTA.setPassword(
    OTA_PASSWORD
  );

  ArduinoOTA.onStart([]() {

    // OTA laikā sūknis obligāti OFF.
    digitalWrite(
      RELAY_PIN,
      RELAY_OFF
    );

    pumpRunning = false;

    pumpPlannedDurationMs = 0;

    rtcPumpWasRunning = false;

    disableWatchdogForOTA();

    Serial.println(
      "OTA sākas — "
      "sūknis izslēgts, "
      "WDT atslēgts"
    );
  });

  ArduinoOTA.onEnd([]() {

    Serial.println(
      "\nOTA pabeigts — "
      "gaidu restartu"
    );
  });

  ArduinoOTA.onError(
    [](ota_error_t error) {

      Serial.println(
        "OTA kļūda #" +
        String(error)
      );

      // WDT OTA laikā tika noņemts.
      // Drošākais stāvoklis pēc neveiksmīga OTA
      // ir tīrs restarts ar releju OFF.
      digitalWrite(
        RELAY_PIN,
        RELAY_OFF
      );

      delay(250);

      ESP.restart();
    }
  );

  ArduinoOTA.begin();

  otaStarted = true;

  Serial.println(
    "OTA gatavs (" +
    WiFi.localIP().toString() +
    ")"
  );
}

// ============================================================
// LAIKA SINHRONIZĀCIJA
// ============================================================

void setupTimeOnce() {

  if (timeConfigured) {
    return;
  }

  // configTime(0, 0, ...) pārraksta TZ uz UTC.
  // Izmantojam configTzTime(), lai CET/CEST pārejas noteikumus
  // piemērotu arī pēc SNTP inicializācijas.
  configTzTime(
    TZ_INFO,
    NTP_SERVER_1,
    NTP_SERVER_2,
    NTP_SERVER_3
  );

  timeConfigured = true;

  Serial.println(
    "NTP konfigurēts"
  );
}

// ============================================================
// Wi-Fi
// ============================================================

void setupWiFi() {

  WiFi.mode(
    WIFI_STA
  );

  WiFi.persistent(
    false
  );

  WiFi.setAutoReconnect(
    true
  );

  // Ierīce darbojas no pastāvīgas barošanas.
  // Atslēdzam Wi-Fi sleep, lai samazinātu
  // latentumu un nejaušus MQTT timeout.
  WiFi.setSleep(
    false
  );

  WiFi.setHostname(
    OTA_HOSTNAME
  );

  WiFi.begin(
    WIFI_SSID,
    WIFI_PASSWORD
  );

  lastWiFiReconnectAttempt =
      millis();

  Serial.println(
    "WiFi pieslēgšanās sākta..."
  );
}

void serviceWiFi() {

  bool connected =
      WiFi.status() ==
      WL_CONNECTED;

  if (connected) {

    if (!wifiOnline) {

      wifiOnline = true;

      Serial.println(
        "WiFi savienots! IP: " +
        WiFi.localIP().toString()
      );

      if (wifiEverConnected) {
        pendingWiFiRestoredLog = true;
      }

      wifiEverConnected = true;

      setupTimeOnce();
      setupOTA();
    }

    return;
  }

  // Tikko zaudējām Wi-Fi.
  if (wifiOnline) {

    wifiOnline = false;

    // Pieprasām bounded adapter cleanup. Ja 250 ms logā tas vēl nav
    // termināls, serviceMQTT() turpinās service() arī ar Wi-Fi down.
    mqtt.forceDisconnect();

    Serial.println(
      "WiFi savienojums pazudis"
    );
  }

  uint32_t now =
      millis();

  if (
      now -
      lastWiFiReconnectAttempt >=
      WIFI_RECONNECT_INTERVAL_MS
  ) {

    lastWiFiReconnectAttempt =
        now;

    Serial.println(
      "Mēģinu atjaunot WiFi..."
    );

    // Nebloķējam loop().
    // ESP32 savienošanos turpina fonā.
    WiFi.reconnect();
  }
}

// ============================================================
// SENSORI
// ============================================================

void selectSensor(
  int channel
) {

  digitalWrite(
    MUX_S0,
    (channel >> 0) & 1
  );

  digitalWrite(
    MUX_S1,
    (channel >> 1) & 1
  );

  digitalWrite(
    MUX_S2,
    (channel >> 2) & 1
  );

  digitalWrite(
    MUX_S3,
    (channel >> 3) & 1
  );

  // Ļaujam MUX signālam stabilizēties.
  delay(10);

  // Pirmo ADC mērījumu pēc kanāla maiņas izmetam.
  analogRead(MUX_SIG);

  delay(5);
}

// Atgriež:
// -1 = sensors nav uzskatāms par pievienotu/stabilu
// citādi = RAW ADC vidējā vērtība.
int readMoistureRaw(
  int sensorIndex
) {

  selectSensor(
    sensorIndex
  );

  constexpr int SAMPLES = 10;

  int minVal = 4095;
  int maxVal = 0;

  long sum = 0;

  for (
      int i = 0;
      i < SAMPLES;
      i++
  ) {

    int value =
        analogRead(
          MUX_SIG
        );

    if (value < minVal) {
      minVal = value;
    }

    if (value > maxVal) {
      maxVal = value;
    }

    sum += value;

    delay(2);
  }

  int average =
      sum /
      SAMPLES;

  int spread =
      maxVal -
      minVal;

  // Ļoti nestabils signāls.
  if (spread > 200) {
    return -1;
  }

  // Praktiski ADC robeža.
  if (
      average < 100 ||
      average > 4090
  ) {
    return -1;
  }

  return average;
}

String categorizeMoisture(
  int raw
) {

  if (raw == -1) {
    return "";
  }

  if (
      raw >
      MOISTURE_DRY_THRESHOLD
  ) {
    return "sauss";
  }

  if (
      raw <
      MOISTURE_WET_THRESHOLD
  ) {
    return "mitrs";
  }

