rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
  return "videjs";
}

String categoryEmoji(
  const String& category
) {

  if (category == "sauss") {
    return "🔴";
  }

  if (category == "videjs") {
    return "🟡";
  }

  if (category == "mitrs") {
    return "🔵";
  }

  return "⚪";
}

// ============================================================
// MQTT KOMANDU RINDA
// ============================================================

void enqueueCommand(
  bool fromHA,
  const String& payload
) {

  // Ja rinda pilna, izmetam vecāko PARASTO komandu.
  // STOP/OFF šo FIFO vispār neizmanto.
  if (
      commandQueueCount >=
      COMMAND_QUEUE_SIZE
  ) {

    commandQueue[
      commandQueueHead
    ].payload = "";

    commandQueueHead =
        (commandQueueHead + 1) %
        COMMAND_QUEUE_SIZE;

    commandQueueCount--;

    Serial.println(
      "BRĪDINĀJUMS: komandu rinda pilna, "
      "vecākā komanda izmesta"
    );
  }

  commandQueue[
    commandQueueTail
  ].fromHA = fromHA;

  commandQueue[
    commandQueueTail
  ].stopEpoch = pumpStopEpoch;

  commandQueue[
    commandQueueTail
  ].payload = payload;

  commandQueueTail =
      (commandQueueTail + 1) %
      COMMAND_QUEUE_SIZE;

  commandQueueCount++;
}

bool dequeueCommand(
  PendingCommand& out
) {

  if (
      commandQueueCount == 0
  ) {
    return false;
  }

  out.fromHA =
      commandQueue[
        commandQueueHead
      ].fromHA;

  out.stopEpoch =
      commandQueue[
        commandQueueHead
      ].stopEpoch;

  out.payload =
      commandQueue[
        commandQueueHead
      ].payload;

  commandQueue[
    commandQueueHead
  ].payload = "";

  commandQueueHead =
      (commandQueueHead + 1) %
      COMMAND_QUEUE_SIZE;

  commandQueueCount--;

  return true;
}

// ============================================================
// HOME ASSISTANT DISCOVERY
// ============================================================

bool publishDiscoverySensor(uint8_t sensor) {

  char topic[96];
  char payload[600];

  snprintf(
    topic,
    sizeof(topic),
    "homeassistant/sensor/"
    "balkons_puke%d/config",
    sensor + 1
  );

  snprintf(
    payload,
    sizeof(payload),

    "{"
    "\"name\":\"Puķe %d\","
    "\"stat_t\":\"balkons/puke%d/mitrums\","
    "\"exp_aft\":180,"
    "\"icon\":\"mdi:flower\","
    "\"uniq_id\":\"balkons_puke%d\","
    "\"avty_t\":\"balkons/status\","
    "\"dev\":{"
      "\"ids\":[\"balkons_esp32\"],"
      "\"name\":\"Balkona Laistīšana\","
      "\"mf\":\"Andris\","
      "\"mdl\":\"ESP32\""
    "}"
    "}",

    sensor + 1,
    sensor + 1,
    sensor + 1
  );

  return mqtt.publishBestEffort(
    topic,
    payload,
    true
  );
}

bool publishDiscoveryPump() {

  char topic[96];
  char payload[600];

  snprintf(
    topic,
    sizeof(topic),
    "homeassistant/switch/"
    "balkons_sukna/config"
  );

  snprintf(
    payload,
    sizeof(payload),

    "{"
    "\"name\":\"Sūknis\","
    "\"cmd_t\":\"balkons/sukna/komanda\","
    "\"stat_t\":\"balkons/sukna/stends\","
    "\"pl_on\":\"ON\","
    "\"pl_off\":\"OFF\","
    "\"icon\":\"mdi:water-pump\","
    "\"uniq_id\":\"balkons_sukna\","
    "\"avty_t\":\"balkons/status\","
    "\"dev\":{"
      "\"ids\":[\"balkons_esp32\"],"
      "\"name\":\"Balkona Laistīšana\","
      "\"mf\":\"Andris\","
      "\"mdl\":\"ESP32\""
    "}"
    "}"
  );

  return mqtt.publishBestEffort(
    topic,
    payload,
    true
  );
}

void resetMqttSessionInit() {
  mqttSessionInitState = MqttSessionInitState::Idle;
  mqttDiscoverySensorIndex = 0;
  mqttSessionStepStartedAt = 0;
  mqttDiscoveryWindowStartedAt = 0;
  mqtt.resetTrackedSubscription();
}

void mqttConnectedHandler(bool sessionPresent) {
  (void)sessionPresent;

  mqtt.resetTrackedSubscription();
  mqttDiscoverySensorIndex = 0;
  mqttSessionStepStartedAt = millis();
  mqttDiscoveryWindowStartedAt = 0;
  mqttSessionInitState = MqttSessionInitState::SubscribePump;
}

void mqttDisconnectedHandler(espMqttClientTypes::DisconnectReason reason) {
  (void)reason;
  resetMqttSessionInit();
}

void handleCriticalMqttSessionInitFailure() {
  // Ja pump jau darbojas un connected command path vēl ir pieejams,
  // to netear-downojam. Pēc pump OFF nākamais loop drīkst cleanup/reconnect.
  if (pumpRunning) {
    return;
  }

  mqtt.forceDisconnect();
}

void serviceMqttSessionInit() {

  if (
      !mqtt.isConnected() ||
      mqttSessionInitState == MqttSessionInitState::Idle ||
      mqttSessionInitState == MqttSessionInitState::Done
  ) {
    return;
  }

  const uint32_t now = millis();

  switch (mqttSessionInitState) {

    case MqttSessionInitState::SubscribePump:
      if (mqtt.startTrackedSubscription(T_PUMP_CMD)) {
        mqttSessionInitState = MqttSessionInitState::AwaitPumpSuback;
        mqttSessionStepStartedAt = now;
        return;
      }

      if (
          mqtt_runtime_policy::hasElapsed(
            now,
            mqttSessionStepStartedAt,
            MQTT_SESSION_CRITICAL_STEP_BUDGET_MS
          )
      ) {
        handleCriticalMqttSessionInitFailure();
      }
      return;

    case MqttSessionInitState::AwaitPumpSuback: {
      const auto state = mqtt.trackedSubscriptionState(now);

      if (state == mqtt_runtime_policy::TrackedSubscriptionState::awaitingAck) {
        return;
      }

      if (state != mqtt_runtime_policy::TrackedSubscriptionState::accepted) {
        handleCriticalMqttSessionInitFailure();
        return;
      }

      mqtt.resetTrackedSubscription();
      mqttSessionInitState = MqttSessionInitState::SubscribeCmd;
      mqttSessionStepStartedAt = now;
      return;
    }

    case MqttSessionInitState::SubscribeCmd:
      if (mqtt.startTrackedSubscription(T_CMD)) {
        mqttSessionInitState = MqttSessionInitState::AwaitCmdSuback;
        mqttSessionStepStartedAt = now;
        return;
      }

      if (
          mqtt_runtime_policy::hasElapsed(
            now,
            mqttSessionStepStartedAt,
            MQTT_SESSION_CRITICAL_STEP_BUDGET_MS
          )
      ) {
        handleCriticalMqttSessionInitFailure();
      }
      return;

    case MqttSessionInitState::AwaitCmdSuback: {
      const auto state = mqtt.trackedSubscriptionState(now);

