rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
      if (state == mqtt_runtime_policy::TrackedSubscriptionState::awaitingAck) {
        return;
      }

      if (state != mqtt_runtime_policy::TrackedSubscriptionState::accepted) {
        handleCriticalMqttSessionInitFailure();
        return;
      }

      mqtt.resetTrackedSubscription();
      mqttSessionInitState = MqttSessionInitState::Online;
      mqttSessionStepStartedAt = now;
      return;
    }

    case MqttSessionInitState::Online:
      if (
          mqtt.publishBestEffort(
            T_STATUS,
            "online",
            true
          )
      ) {
        mqttSessionInitState = MqttSessionInitState::DiscoverySensors;
        mqttDiscoverySensorIndex = 0;
        mqttDiscoveryWindowStartedAt = now;
        return;
      }

      if (
          mqtt_runtime_policy::hasElapsed(
            now,
            mqttSessionStepStartedAt,
            MQTT_SESSION_CRITICAL_STEP_BUDGET_MS
          )
      ) {
        handleCriticalMqttSessionInitFailure();
      }
      return;

    case MqttSessionInitState::DiscoverySensors:
      if (
          mqtt_runtime_policy::hasElapsed(
            now,
            mqttDiscoveryWindowStartedAt,
            MQTT_DISCOVERY_WINDOW_BUDGET_MS
          )
      ) {
        Serial.println(
          "MQTT discovery logs izsmelts — atlikusī sensoru discovery izlaista"
        );
        mqttSessionInitState = MqttSessionInitState::DiscoveryPump;
        return;
      }

      if (mqttDiscoverySensorIndex >= SENSOR_COUNT) {
        mqttSessionInitState = MqttSessionInitState::DiscoveryPump;
        return;
      }

      if (publishDiscoverySensor(mqttDiscoverySensorIndex)) {
        mqttDiscoverySensorIndex++;
      }
      return;

    case MqttSessionInitState::DiscoveryPump:
      if (
          mqtt_runtime_policy::hasElapsed(
            now,
            mqttDiscoveryWindowStartedAt,
            MQTT_DISCOVERY_WINDOW_BUDGET_MS
          ) ||
          publishDiscoveryPump()
      ) {
        mqttSessionInitState = MqttSessionInitState::PumpStatus;
        mqttSessionStepStartedAt = now;
      }
      return;

    case MqttSessionInitState::PumpStatus:
      if (publishPumpStatus()) {
        mqttSessionInitState = MqttSessionInitState::ConnectedLog;
        return;
      }

      if (
          mqtt_runtime_policy::hasElapsed(
            now,
            mqttSessionStepStartedAt,
            MQTT_SESSION_CRITICAL_STEP_BUDGET_MS
          )
      ) {
        handleCriticalMqttSessionInitFailure();
      }
      return;

    case MqttSessionInitState::ConnectedLog:
      logEvent("MQTT savienots");
      mqttSessionInitState = MqttSessionInitState::StartupLog;
      return;

    case MqttSessionInitState::StartupLog:
      if (startupLogPending) {
        startupLogPending = false;

        logEvent(
          "Sistēma startēja — "
          "restarta iemesls: " +
          resetReasonStr() +
          ", brīvā atmiņa: " +
          String(
            ESP.getFreeHeap() /
            1024
          ) +
          " KB, firmware: " +
          String(FIRMWARE_GIT_REV)
        );
      }

      mqttSessionInitState = MqttSessionInitState::StartupPumpWarning;
      return;

    case MqttSessionInitState::StartupPumpWarning:
      if (pumpWasRunningAtBoot) {
        tgSend(
          "⚠️ Sistēma restartējās "
          "laistīšanas laikā. "
          "Sūknis TAGAD ir izslēgts. "
          "Pārbaudi manuāli, ja šaubies."
        );

        pumpWasRunningAtBoot = false;
      }

      mqttSessionInitState = MqttSessionInitState::WifiRestoredLog;
      return;

    case MqttSessionInitState::WifiRestoredLog:
      if (pendingWiFiRestoredLog) {
        pendingWiFiRestoredLog = false;

        logEvent(
          "WiFi ATJAUNOTS pēc pazušanas, "
          "IP: " +
          WiFi.localIP().toString() +
          ", signāls: " +
          String(
            WiFi.RSSI()
          ) +
          " dBm"
        );
      }

      // Ready nav atkarīgs no Telegram PUBACK. Jauns Telegram network
      // enqueue un periodiskais moisture sākas tikai pēc šīs pārejas.
      mqttSessionInitState = MqttSessionInitState::Done;
      lastMqttPublish =
          millis() -
          MQTT_PUBLISH_INTERVAL_MS;
      return;

    case MqttSessionInitState::Idle:
    case MqttSessionInitState::Done:
      return;
  }
}

// ============================================================
// MQTT
// ============================================================

bool isCommandTrimChar(char value) {
  return value == ' ' || value == '\t' || value == '\r' || value == '\n';
}

void trimCommandBuffer(char* command, std::size_t& length) {
  std::size_t first = 0;

  while (first < length && isCommandTrimChar(command[first])) {
    first++;
  }

  std::size_t last = length;
  while (last > first && isCommandTrimChar(command[last - 1U])) {
    last--;
  }

  const std::size_t trimmedLength = last - first;
  if (first > 0U && trimmedLength > 0U) {
    std::memmove(command, command + first, trimmedLength);
  }

  length = trimmedLength;
  command[length] = '\0';
}

void mqttMessageHandler(
  const char* topic,
  const std::uint8_t* payload,
  std::size_t length,
  const mqtt_runtime_policy::InboundMetadata& metadata
) {
  (void)metadata;

  bool fromHA = false;
  bool recognizedTopic = false;

  if (strcmp(topic, T_PUMP_CMD) == 0) {
    fromHA = true;
    recognizedTopic = true;
  } else if (strcmp(topic, T_CMD) == 0) {
    recognizedTopic = true;
  }

  if (!recognizedTopic) {
    return;
  }

  if (
      !command_payload_policy::isCommandPayloadLengthAllowed(
        length
      )
  ) {
    oversizedCommandDrops++;
    return;
  }

  char command[command_payload_policy::kMaxCommandPayloadBytes + 1U] = {0};

  if (length > 0U) {
    std::memcpy(command, payload, length);
  }
  command[length] = '\0';

  trimCommandBuffer(command, length);

  // Urgent STOP/OFF tiek pārbaudīts uz fixed buffer pirms dinamiska String.
  if (
      command_safety::isUrgentStop(
        fromHA,
        command
      )
  ) {
    requestUrgentPumpStop(fromHA);
    return;
  }

  String message(command);
  enqueueCommand(fromHA, message);
}

void mqttRejectedHandler(
  mqtt_runtime_policy::RejectReason reason,
  std::size_t totalBytes
) {
  if (reason == mqtt_runtime_policy::RejectReason::oversized) {
    oversizedCommandDrops++;
  }

  Serial.printf(
    "BRĪDINĀJUMS: MQTT komanda atmesta adapterī (reason=%u, len=%u)\n",
    static_cast<unsigned int>(reason),
    static_cast<unsigned int>(totalBytes)
  );
}

void handleDeferredSystemLogs() {

  if (startupLogPending) {

