rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
    startupLogPending = false;

    logEvent(
      "Sistēma startēja — "
      "restarta iemesls: " +
      resetReasonStr() +
      ", brīvā atmiņa: " +
      String(
        ESP.getFreeHeap() /
        1024
      ) +
      " KB, firmware: " +
      String(FIRMWARE_GIT_REV)
    );

    if (pumpWasRunningAtBoot) {

      tgSend(
        "⚠️ Sistēma restartējās "
        "laistīšanas laikā. "
        "Sūknis TAGAD ir izslēgts. "
        "Pārbaudi manuāli, ja šaubies."
      );

      pumpWasRunningAtBoot = false;
    }
  }

  if (pendingWiFiRestoredLog) {

    pendingWiFiRestoredLog = false;

    logEvent(
      "WiFi ATJAUNOTS pēc pazušanas, "
      "IP: " +
      WiFi.localIP().toString() +
      ", signāls: " +
      String(
        WiFi.RSSI()
      ) +
      " dBm"
    );
  }
}

void connectMQTT() {

  if (
      WiFi.status() != WL_CONNECTED ||
      pumpRunning ||
      !mqtt.isDisconnected()
  ) {
    return;
  }

  Serial.println(
    "Mēģinu pieslēgt MQTT..."
  );

  if (mqtt.connectBlocking()) {
    Serial.println(
      "MQTT transports savienots; gaidu broker-confirmētu session init"
    );
    return;
  }

  static uint32_t lastFailLog = 0;

  Serial.println(
    "MQTT savienojums neizdevās"
  );

  if (
      millis() -
      lastFailLog >=
      60000UL
  ) {
    lastFailLog = millis();

    sendSyslog(
      "MQTT savienojums NEIZDEVĀS"
    );
  }
}

void serviceMQTT() {

  const bool wifiConnected =
      WiFi.status() ==
      WL_CONNECTED;

  const bool mqttConnected =
      mqtt.isConnected();

  if (!wifiConnected) {
    if (!mqtt.isDisconnected()) {
      mqtt.service();
    }
    return;
  }

  if (mqttConnected) {
    mqtt.service();
    serviceMqttSessionInit();
    return;
  }

  if (mqtt.isTransitioning()) {
    mqtt.service();

    if (
        mqtt_runtime_policy::shouldAbortTransitionalConnection(
          pumpRunning,
          mqtt.isConnected(),
          mqtt.isDisconnected()
        )
    ) {
      mqtt.abortTransition();
    }
    return;
  }

  const uint32_t now = millis();

  if (
      !network_policy::shouldAttemptMqttReconnect(
        wifiConnected,
        mqttConnected,
        pumpRunning,
        now,
        lastMqttReconnectAttempt,
        MQTT_RECONNECT_INTERVAL_MS
      )
  ) {
    return;
  }

  lastMqttReconnectAttempt = now;
  connectMQTT();
}

// ============================================================
// MQTT MITRUMA PUBLICĒŠANA
// ============================================================

void publishMoisture() {

  if (
      !mqttSessionReady() ||
      !mqtt.isConnected()
  ) {
    return;
  }

  char topic[48];

  for (
      int sensor = 0;
      sensor < SENSOR_COUNT;
      sensor++
  ) {

    int raw =
        readMoistureRaw(
          sensor
        );

    servicePumpCriticalNetworkInput();

    String category =
        categorizeMoisture(
          raw
        );

    if (
        category.length() ==
        0
    ) {
      continue;
    }

    snprintf(
      topic,
      sizeof(topic),
      "balkons/puke%d/mitrums",
      sensor + 1
    );

    // QoS0 telemetry ir best-effort. Queue pressure nozīmē drop, ne retry burst.
    mqtt.publishBestEffort(
      topic,
      category.c_str(),
      false
    );

    servicePump();
  }

  Serial.println(
    "MQTT mitrums nosūtīts"
  );
}

// ============================================================
// KOMANDAS
// ============================================================

void processHACommand(
  String command
) {

  command.trim();

  if (
      command ==
      "ON"
  ) {

    if (!pumpRunning) {

      startPump(
        MAX_PUMP_SECONDS
      );
    }

  } else if (
      command ==
      "OFF"
  ) {

    if (pumpRunning) {

      stopPump(
        "Home Assistant OFF"
      );
    }
  }
}

void processCommand(
  String command
) {

  command.trim();

  logEvent(
    "Komanda (MQTT): " +
    command
  );

  // ----------------------------------------------------------
  // /laist
  // ----------------------------------------------------------

  if (
      command ==
      "laist"
  ) {

    if (pumpRunning) {

      uint32_t added =
          extendPump(
            DEFAULT_PUMP_SECONDS
          );

      if (added > 0) {

        tgSend(
          "💧 Sūknis jau darbojas — "
          "pagarinu par " +
          String(added) +
          " sekundēm!"
        );

      } else {

        tgSend(
          "⚠️ Sūknim jau sasniegts "
          "maksimālais " +
          String(
            MAX_PUMP_SECONDS
          ) +
          " sekunžu limits."
        );
      }

    } else {

      startPump(
        DEFAULT_PUMP_SECONDS
      );
    }
  }

  // ----------------------------------------------------------
  // /laist_X
  // ----------------------------------------------------------

  else if (
      command.startsWith(
        "laist_"
      )
  ) {

    int minutes =
        command
          .substring(6)
          .toInt();

    int maxMinutes =
        MAX_PUMP_SECONDS /
        60;

    if (
        minutes > 0 &&
        minutes <= maxMinutes
    ) {

      uint32_t requestedSeconds =
          static_cast<uint32_t>(
            minutes
          ) *
          60UL;

      if (pumpRunning) {

        uint32_t added =
            extendPump(
              requestedSeconds
            );

        if (added > 0) {

          tgSend(
            "💧 Laistīšana pagarināta par " +
            String(added) +
            " sek!"
          );

        } else {

          tgSend(
            "⚠️ Jau sasniegts maksimālais " +
            String(
              MAX_PUMP_SECONDS
            ) +
            " sekunžu limits."
          );
        }

      } else {

        startPump(
          requestedSeconds
        );
      }

    } else {

      tgSend(
        "❌ Ievadi 1-" +
        String(
          maxMinutes
        ) +
        " minūtes"
      );
    }
  }

  // ----------------------------------------------------------
  // /stop
  // ----------------------------------------------------------

  else if (
      command ==
      "stop"
  ) {

    if (pumpRunning) {

      stopPump(
        "manuāla STOP komanda"
      );

    } else {

      tgSend(
        "Sūknis jau bija izslēgts."
      );
    }
  }

  // ----------------------------------------------------------
  // /mitrums
  // ----------------------------------------------------------

  else if (
      command ==
      "mitrums"
  ) {

    String result =
        "🌱 Mitruma stāvoklis:\n\n";

