rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
    result.reserve(
      600
    );

    int activeCount = 0;

    for (
        int sensor = 0;
        sensor < SENSOR_COUNT;
        sensor++
    ) {

      int raw =
          readMoistureRaw(
            sensor
          );

      servicePumpCriticalNetworkInput();

      String category =
          categorizeMoisture(
            raw
          );

      if (
          category.length() ==
          0
      ) {

        result +=
            "Puķe " +
            String(
              sensor + 1
            ) +
            ": nav pievienots\n";

      } else {

        result +=
            categoryEmoji(
              category
            ) +
            " Puķe " +
            String(
              sensor + 1
            ) +
            ": " +
            category +
            "\n";

        activeCount++;
      }
    }

    result +=
        "\nAktīvi sensori: " +
        String(
          activeCount
        ) +
        "/" +
        String(
          SENSOR_COUNT
        );

    tgSend(
      result
    );
  }

  // ----------------------------------------------------------
  // /raw
  // ----------------------------------------------------------

  else if (
      command ==
      "raw"
  ) {

    String result =
        "🔧 RAW ADC vērtības:\n\n";

    result.reserve(
      500
    );

    for (
        int sensor = 0;
        sensor < SENSOR_COUNT;
        sensor++
    ) {

      selectSensor(
        sensor
      );

      long sum = 0;

      for (
          int i = 0;
          i < 10;
          i++
      ) {

        sum +=
            analogRead(
              MUX_SIG
            );

        delay(2);
      }

      int average =
          sum /
          10;

      servicePumpCriticalNetworkInput();

      result +=
          "Puķe " +
          String(
            sensor + 1
          ) +
          ": " +
          String(
            average
          ) +
          "\n";
    }

    tgSend(
      result
    );
  }

  // ----------------------------------------------------------
  // /statuss
  // ----------------------------------------------------------

  else if (
      command ==
      "statuss"
  ) {

    String status =
        "⚙️ Statuss:\n";

    status.reserve(
      640
    );

    status +=
        "Sūknis: " +
        String(
          pumpRunning ?
          "🟢 Darbojas" :
          "🔴 Izslēgts"
        ) +
        "\n";

    if (pumpRunning) {

      uint32_t elapsedMs =
          millis() -
          pumpSessionStartMs;

      uint32_t remainingMs = 0;

      if (
          pumpPlannedDurationMs >
          elapsedMs
      ) {

        remainingMs =
            pumpPlannedDurationMs -
            elapsedMs;
      }

      // Noapaļojam uz augšu,
      // lai 14999 ms rādītu 15 sek.
      uint32_t remainingSeconds =
          (
            remainingMs +
            999UL
          ) /
          1000UL;

      status +=
          "Atlikušais laiks: " +
          String(
            remainingSeconds
          ) +
          " sek\n";
    }

    if (
        WiFi.status() ==
        WL_CONNECTED
    ) {

      status +=
          "WiFi: " +
          WiFi.localIP().toString() +
          "\n";

      status +=
          "Signāls: " +
          String(
            WiFi.RSSI()
          ) +
          " dBm\n";

    } else {

      status +=
          "WiFi: 🔴 atvienots\n";
    }

    status +=
        "MQTT: " +
        String(
          mqtt.connected() ?
          "🟢 savienots" :
          "🔴 atvienots"
        ) +
        "\n";

    status +=
        "Brīvā atmiņa: " +
        String(
          ESP.getFreeHeap() /
          1024
        ) +
        " KB\n";

    status +=
        "Min. brīvā atmiņa: " +
        String(
          ESP.getMinFreeHeap() /
          1024
        ) +
        " KB\n";

    status +=
        "Lielākais heap bloks: " +
        String(
          ESP.getMaxAllocHeap() /
          1024
        ) +
        " KB\n";

    status +=
        "Loop steks min. brīvs: " +
        String(
          static_cast<unsigned long>(
            uxTaskGetStackHighWaterMark(
              nullptr
            )
          )
        ) +
        " B\n";

    status +=
        "Pārāk garas komandas: " +
        String(
          oversizedCommandDrops
        ) +
        "\n";

    status +=
        "Laiks: " +
        getTimeString() +
        "\n";

    status +=
        "Firmware: " +
        String(FIRMWARE_GIT_REV) +
        "\n";

    status +=
        "Uptime: " +
        getUptimeString();

    tgSend(
      status
    );
  }

  // ----------------------------------------------------------
  // /statistika
  // ----------------------------------------------------------

  else if (
      command ==
      "statistika"
  ) {

    String stats =
        "📊 Statistika:\n\n";

    stats +=
        "Laistīšanas reizes: " +
        String(
          totalWaterings
        ) +
        "\n";

    stats +=
        "Kopējais sūkņa laiks: " +
        String(
          totalPumpSeconds
        ) +
        " sek\n";

    if (
        lastWateringTime >
        1700000000
    ) {

      struct tm timeinfo;

      localtime_r(
        &lastWateringTime,
        &timeinfo
      );

      char buf[32];

      strftime(
        buf,
        sizeof(buf),
        "%d.%m.%Y %H:%M:%S",
        &timeinfo
      );

      stats +=
          "Pēdējā laistīšana: " +
          String(buf);
    }

    tgSend(
      stats
    );
  }

  // ----------------------------------------------------------
  // Nezināma komanda
  // ----------------------------------------------------------

  else {

    tgSend(
      "❓ Nezināma komanda: " +
      command
    );
  }
}

void processCommandQueue() {

  PendingCommand item;

  // Vienā loop ciklā apstrādājam vienu komandu.
  // Tas neļauj lielai komandbumbai pārāk ilgi
  // aizturēt tīkla un sūkņa drošības funkcijas.
  if (
      !dequeueCommand(
        item
      )
  ) {
    return;
  }

  if (
      command_safety::shouldSuppressQueuedPumpStart(
        item.stopEpoch,
        pumpStopEpoch,
        item.fromHA,
        item.payload.c_str()
      )
  ) {

    logEvent(
      "Drošība: stale pump-start komanda atmesta pēc jaunāka STOP/OFF"
    );

    return;
  }

  if (item.fromHA) {

