rozkalnsandris/balcony-irrigation-esp32/src/main.cpp
    processHACommand(
      item.payload
    );

  } else {

    processCommand(
      item.payload
    );
  }
}

// ============================================================
// SETUP
// ============================================================

void setup() {

  Serial.begin(
    115200
  );

  delay(100);

  // ----------------------------------------------------------
  // Relejs VISPIRMS droši OFF.
  // ----------------------------------------------------------

  pinMode(
    RELAY_PIN,
    OUTPUT
  );

  digitalWrite(
    RELAY_PIN,
    RELAY_OFF
  );

  // Saglabājam informāciju par iepriekšējo restartu,
  // bet uzreiz notīrām RTC flagu, jo sūknis jau ir OFF.
  pumpWasRunningAtBoot =
      rtcPumpWasRunning;

  rtcPumpWasRunning =
      false;

  // ----------------------------------------------------------
  // MUX
  // ----------------------------------------------------------

  pinMode(
    MUX_S0,
    OUTPUT
  );

  pinMode(
    MUX_S1,
    OUTPUT
  );

  pinMode(
    MUX_S2,
    OUTPUT
  );

  pinMode(
    MUX_S3,
    OUTPUT
  );

  pinMode(
    MUX_SIG,
    INPUT
  );

  // Explicit 12-bit ADC.
  // Tavi pašreizējie sliekšņi ir kalibrēti 0-4095 diapazonam.
  analogReadResolution(
    12
  );

  // ----------------------------------------------------------
  // Watchdog
  // ----------------------------------------------------------

  setupWatchdog();

  // ----------------------------------------------------------
  // Unikāls MQTT Client ID
  // ----------------------------------------------------------

  uint64_t chipId =
      ESP.getEfuseMac();

  snprintf(
    mqttClientId,
    sizeof(mqttClientId),
    "%s-%06llX",
    MQTT_CLIENT_ID_BASE,
    static_cast<unsigned long long>(
      chipId &
      0xFFFFFFULL
    )
  );

  Serial.println(
    "MQTT Client ID: " +
    String(
      mqttClientId
    )
  );

  // ----------------------------------------------------------
  // MQTT
  // ----------------------------------------------------------

  mqtt.configure(
    MQTT_SERVER,
    MQTT_PORT,
    mqttClientId,
    MQTT_USERNAME,
    MQTT_PASSWORD,
    T_STATUS,
    "offline"
  );

  mqtt.setConnectedHandler(
    mqttConnectedHandler
  );

  mqtt.setDisconnectedHandler(
    mqttDisconnectedHandler
  );

  mqtt.setMessageHandler(
    mqttMessageHandler
  );

  mqtt.setRejectedHandler(
    mqttRejectedHandler
  );

  // ----------------------------------------------------------
  // Wi-Fi
  // ----------------------------------------------------------

  setupWiFi();

  Serial.println(
    "Sistēma startēta. "
    "Gaidu WiFi/MQTT... 🌱"
  );
}

// ============================================================
// LOOP
// ============================================================

void loop() {

  feedWatchdog();

  // Ja urgent STOP palicis no iepriekšējā tīkla callback,
  // tas vienmēr dominē pirms jebkura cita loop darba.
  serviceUrgentPumpStop();

  // Sūkņa drošību pārbaudām pašā loop sākumā.
  servicePump();

  // ----------------------------------------------------------
  // Wi-Fi
  // ----------------------------------------------------------

  serviceWiFi();

  // ----------------------------------------------------------
  // OTA
  // ----------------------------------------------------------

  if (
      otaStarted &&
      WiFi.status() ==
      WL_CONNECTED
  ) {

    ArduinoOTA.handle();
  }

  // ----------------------------------------------------------
  // MQTT
  // ----------------------------------------------------------

  serviceMQTT();

  // mqtt.loop() varēja pieņemt urgent STOP/OFF. Relejs callbackā
  // jau tika fiziski izslēgts; šeit nekavējoties sakārtojam state,
  // statistiku, logus un retained statusu pirms parastās FIFO.
  serviceUrgentPumpStop();

  // Pēc iespējami bloķējoša tīkla mēģinājuma
  // vēlreiz pārbaudām sūkņa laiku.
  servicePump();

  // ----------------------------------------------------------
  // MQTT komandas
  // ----------------------------------------------------------

  processCommandQueue();

  // Komanda varēja ieslēgt vai izslēgt sūkni.
  servicePump();

  // ----------------------------------------------------------
  // Periodiska mitruma publicēšana
  // ----------------------------------------------------------

  if (
      mqtt.connected() &&
      millis() -
      lastMqttPublish >=
      MQTT_PUBLISH_INTERVAL_MS
  ) {

    lastMqttPublish =
        millis();

    publishMoisture();
  }

  // ----------------------------------------------------------
  // Pabeigtas laistīšanas paziņojums
  // ----------------------------------------------------------

  if (
      notifyPumpDone
  ) {

    notifyPumpDone =
        false;

    tgSend(
      "✅ Laistīšana pabeigta! (" +
      String(
        lastRunSeconds
      ) +
      " sek)"
    );
  }

  // ----------------------------------------------------------
  // Pēc application session Ready apkalpojam vienu bounded Telegram soli.
  // ----------------------------------------------------------

  if (mqttSessionReady()) {
    serviceTelegramDelivery();
  }

  // Īss yield sistēmas taskiem.
  delay(1);
}
